---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.PossibleExtrusionAxes
source: html/ce756e53-f2a1-190d-0004-d0ba6d6e7988.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.PossibleExtrusionAxes Property

The axes to try when generating the properties of the extrusion.

## Syntax (C#)
```csharp
public IFCExtrusionAxes PossibleExtrusionAxes { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration